Test/ToolOpenFoamErrorFacesNotInTriangularOrderRenumberMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            zeroGradient;
        nFaces          3;
        startFace       3;
    }
    right
    {
        type            zeroGradient;
        nFaces          1;
        startFace       6;
    }
    left
    {
        type            zeroGradient;
        nFaces          1;
        startFace       7;
    }
    front
    {
        type            zeroGradient;
        nFaces          1;
        startFace       8;
    }
    bottom
    {
        type            zeroGradient;
        nFaces          3;
        startFace       9;
    }
)

// ************************************************************************* //
